// 1 . Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.

function squareNumber(num) {
  return num * num
}
console.log(squareNumber(6))

// =================================================================

// 2 . Сделайте функцию, которая возвращает сумму двух чисел.

function sumNumbers(num) {
  return num + num
}

console.log(sumNumbers(3))

// =================================================================

// 3 .Сделайте функцию, которая отнимает от первого числа второе и делит на третье.

function takes(a, b, c) {
  return (a - b) / c
}

console.log(takes(40, 10, 5))

// =================================================================

// 4 . Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.

function dayWeek(a) {
  switch (a) {
    case 1:
      return 'Понедельник'
      break
    case 2:
      return 'Вторник'
      break
    case 3:
      return 'Среда'
      break
    case 4:
      return 'Четверг'
      break
    case 5:
      return 'Пятница'
      break
    case 6:
      return 'Суббота'
      break
    case 7:
      return 'Воскресенье'
      break
  }
}

console.log(dayWeek(5))

// =================================================================

// 5 . Сделайте функцию, которая параметрами принимает 2 числа. Если эти числа равны - пусть функция вернет true, а если не равны - false.

function bool(a, b) {
  return a === b ? true : false
}

console.log(bool(3, 3))

// =================================================================

// 6 . Сделайте функцию, которая параметрами принимает 2 числа. Если их сумма больше 10 - пусть вернет true, а если нет то - false.

function boolSum(a, b) {
  return a + b > 10 ? true : false
}

console.log(boolSum(6, 2))

// =================================================================

// 7 . Сделайте функцию, которая параметром принимает число и проверяет - отрицательное оно или нет. Если отрицательное - пусть функция вернет true, а если нет - false.

function negative(a) {
  return a < 0 ? true : false
}

console.log(negative(-6))

// =================================================================

// 8 . Сделайте функцию isNumberInRange, которая параметром принимает число и проверяет, что оно больше нуля и меньше 10. Если это так - пусть функция возвращает true, если не так - false.

function isNumberInRange(a) {
  return a > 0 && a < 10 ? true : false
}

console.log(isNumberInRange(40))

// =================================================================

// 9 .  Сделайте функцию isEven() (even - это четный), которая параметром принимает целое число и проверяет: четное оно или нет. Если четное - пусть функция возвращает true, если нечетное - false.

// =================================================================

function isEven(a) {
  return a % 2 === 0 ? true : false
}

console.log(isEven(2))
